## PROVA 2
#### Antoni Rigo Balaguer

In [7]:
# 1
import pandas as pd
df = pd.DataFrame([(11111111, 25, 'H', 'Enric', 'Oller'),
                   ( 11111112, 23, 'M', 'Antonia', 'Vaquer'), 
                   ( 11111113, 35, 'M', 'Francisca', 'Vidal'),
                   ( 11111114, 44, 'M', 'Maria', 'Barceló'),
                   ( 11111115, 19, 'H', 'Josep', 'Oliver'),
                   ( 11111116, 22, 'M', 'Aina', 'Mas'),
                   ( 11111117, 55, 'M', 'Júlia', 'Pineda'),
                   ( 11111118, 60, 'H', 'Jaume', 'LLiteres'),
                   ( 11111119, 29, 'H', 'Jaume', 'Adrover')],
           columns=('DNI', 'Edad', 'Sexo', 'Nombre', 'Apellidos')
                 )
df

        DNI  Edad Sexo     Nombre Apellidos
0  11111111    25    H      Enric     Oller
1  11111112    23    M    Antonia    Vaquer
2  11111113    35    M  Francisca     Vidal
3  11111114    44    M      Maria   Barceló
4  11111115    19    H      Josep    Oliver
5  11111116    22    M       Aina       Mas
6  11111117    55    M      Júlia    Pineda
7  11111118    60    H      Jaume  LLiteres
8  11111119    29    H      Jaume   Adrover

In [9]:
df2 = pd.DataFrame([(11111111, 'GEIN', 8, 'Sí'),
                   ( 11111112, 'GMAT', 7, 'No'), 
                   ( 11111113, 'GEIN', 6, 'Sí'),
                   ( 11111114, 'GEE', 5, 'Sí'),
                   ( 11111116, 'GFIS', 5.5, 'No'),
                   ( 11111117, 'GQUIM', 9, 'Sí'),
                   ( 11111118, 'GQUIM', 6.4, 'No'),
                   ( 11111119, 'GEE', 8.2, 'Sí'),
                   ( 11111114, 'GFIS', 7.75, 'No')],
           columns=('DNI', 'Estudios', 'Media', 'Acabado')
                 )
df2

        DNI Estudios  Media Acabado
0  11111111     GEIN   8.00      Sí
1  11111112     GMAT   7.00      No
2  11111113     GEIN   6.00      Sí
3  11111114      GEE   5.00      Sí
4  11111115     GFIS   5.50      No
5  11111116    GQUIM   9.00      Sí
6  11111117    GQUIM   6.40      No
7  11111118      GEE   8.20      Sí
8  11111119     GFIS   7.75      No

In [14]:
# 2
df3 = df.merge(df2, left_on='DNI', right_on='DNI')
df3

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media Acabado
0  11111111    25    H      Enric     Oller     GEIN   8.00      Sí
1  11111112    23    M    Antonia    Vaquer     GMAT   7.00      No
2  11111113    35    M  Francisca     Vidal     GEIN   6.00      Sí
3  11111114    44    M      Maria   Barceló      GEE   5.00      Sí
4  11111115    19    H      Josep    Oliver     GFIS   5.50      No
5  11111116    22    M       Aina       Mas    GQUIM   9.00      Sí
6  11111117    55    M      Júlia    Pineda    GQUIM   6.40      No
7  11111118    60    H      Jaume  LLiteres      GEE   8.20      Sí
8  11111119    29    H      Jaume   Adrover     GFIS   7.75      No

In [15]:
df3[df3["Edad"] > 30 ]

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media Acabado
2  11111113    35    M  Francisca     Vidal     GEIN    6.0      Sí
3  11111114    44    M      Maria   Barceló      GEE    5.0      Sí
6  11111117    55    M      Júlia    Pineda    GQUIM    6.4      No
7  11111118    60    H      Jaume  LLiteres      GEE    8.2      Sí

In [17]:
# 3
df_J = df3[df3["Nombre"] == 'Jaume' ]
df_J['Apellidos']

7    LLiteres
8     Adrover
Name: Apellidos, dtype: object

In [26]:
# 4
df_M = df3[df3["Sexo"] == 'M' ]
df_M[['Nombre','Apellidos']]

      Nombre Apellidos
1    Antonia    Vaquer
2  Francisca     Vidal
3      Maria   Barceló
5       Aina       Mas
6      Júlia    Pineda

In [30]:
# 5
df4 = pd.concat([df, df2])
df4

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media Acabado
0  11111111  25.0    H      Enric     Oller      NaN    NaN     NaN
1  11111112  23.0    M    Antonia    Vaquer      NaN    NaN     NaN
2  11111113  35.0    M  Francisca     Vidal      NaN    NaN     NaN
3  11111114  44.0    M      Maria   Barceló      NaN    NaN     NaN
4  11111115  19.0    H      Josep    Oliver      NaN    NaN     NaN
5  11111116  22.0    M       Aina       Mas      NaN    NaN     NaN
6  11111117  55.0    M      Júlia    Pineda      NaN    NaN     NaN
7  11111118  60.0    H      Jaume  LLiteres      NaN    NaN     NaN
8  11111119  29.0    H      Jaume   Adrover      NaN    NaN     NaN
0  11111111   NaN  NaN        NaN       NaN     GEIN   8.00      Sí
1  11111112   NaN  NaN        NaN       NaN     GMAT   7.00      No
2  11111113   NaN  NaN        NaN       NaN     GEIN   6.00      Sí
3  11111114   NaN  NaN        NaN       NaN      GEE   5.00      Sí
4  11111115   NaN  NaN        NaN       NaN     GFIS   5.50      No
5  11111116   NaN  NaN        NaN       NaN    GQUIM   9.00      Sí
6  11111117   NaN  NaN        NaN       NaN    GQUIM   6.40      No
7  11111118   NaN  NaN        NaN       NaN      GEE   8.20      Sí
8  11111119   NaN  NaN        NaN       NaN     GFIS   7.75      No

In [31]:
# 6
Acabado_B = {'Sí' : True, 'No' : False}
Acabado_B

{'Sí': True, 'No': False}

In [33]:
df3["Acabado"] = df3["Acabado"].map(Acabado_B)
df3

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media  Acabado
0  11111111    25    H      Enric     Oller     GEIN   8.00     True
1  11111112    23    M    Antonia    Vaquer     GMAT   7.00    False
2  11111113    35    M  Francisca     Vidal     GEIN   6.00     True
3  11111114    44    M      Maria   Barceló      GEE   5.00     True
4  11111115    19    H      Josep    Oliver     GFIS   5.50    False
5  11111116    22    M       Aina       Mas    GQUIM   9.00     True
6  11111117    55    M      Júlia    Pineda    GQUIM   6.40    False
7  11111118    60    H      Jaume  LLiteres      GEE   8.20     True
8  11111119    29    H      Jaume   Adrover     GFIS   7.75    False

In [35]:
# 7
df_O = df3.sort_values("Media", axis=0, ascending=False)
df_O

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media  Acabado
5  11111116    22    M       Aina       Mas    GQUIM   9.00     True
7  11111118    60    H      Jaume  LLiteres      GEE   8.20     True
0  11111111    25    H      Enric     Oller     GEIN   8.00     True
8  11111119    29    H      Jaume   Adrover     GFIS   7.75    False
1  11111112    23    M    Antonia    Vaquer     GMAT   7.00    False
6  11111117    55    M      Júlia    Pineda    GQUIM   6.40    False
2  11111113    35    M  Francisca     Vidal     GEIN   6.00     True
4  11111115    19    H      Josep    Oliver     GFIS   5.50    False
3  11111114    44    M      Maria   Barceló      GEE   5.00     True

In [39]:
# 8
df_EM =  df3[df3["Acabado"] == True ]
df_EM

        DNI  Edad Sexo     Nombre Apellidos Estudios  Media  Acabado
0  11111111    25    H      Enric     Oller     GEIN    8.0     True
2  11111113    35    M  Francisca     Vidal     GEIN    6.0     True
3  11111114    44    M      Maria   Barceló      GEE    5.0     True
5  11111116    22    M       Aina       Mas    GQUIM    9.0     True
7  11111118    60    H      Jaume  LLiteres      GEE    8.2     True

In [40]:
df_EM["Edad"].mean()

np.float64(37.2)

In [65]:
# 9a
import numpy as np
values, repeticiones = np.unique(df3.Estudios,return_counts=True)
print(values)
print(repeticiones)
# 9b

['GEE' 'GEIN' 'GFIS' 'GMAT' 'GQUIM']
[2 2 2 1 2]